sanhab-templates/registerCarDamageHurtPerson-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:RegWbsCarDocLosPrsn>
         <!--Optional:-->
         <tem:WbsCarDocLosPrsnReq>
            <!--Optional:-->
            <ns:Adrs>${Adrs}</ns:Adrs>
            <!--Optional:-->
            <ns:AgrDte>${AgrDte}</ns:AgrDte>
            <!--Optional:-->
            <ns:BrthDte>${BrthDte}</ns:BrthDte>
            <!--Optional:-->
            <ns:CarGrpCod>${CarGrpCod}</ns:CarGrpCod>
            <!--Optional:-->
            <ns:DieDocDte>${DieDocDte}</ns:DieDocDte>
            <!--Optional:-->
            <ns:DieDte>${DieDte}</ns:DieDte>
            <!--Optional:-->
            <ns:DrRptDte>${DrRptDte}</ns:DrRptDte>
            <!--Optional:-->
            <ns:EstLos>${EstLos}</ns:EstLos>
            <!--Optional:-->
            <ns:FNam>${FNam}</ns:FNam>
            <!--Optional:-->
            <ns:FthNam>${FthNam}</ns:FthNam>
            <!--Optional:-->
            <ns:HrchDte>${HrchDte}</ns:HrchDte>
            <!--Optional:-->
            <ns:IdNum>${IdNum}</ns:IdNum>
            <!--Optional:-->
            <ns:IsIrn>${IsIrn}</ns:IsIrn>
            <!--Optional:-->
            <ns:IsMale>${IsMale}</ns:IsMale>
            <!--Optional:-->
            <ns:LNam>${LNam}</ns:LNam>
            <!--Optional:-->
            <ns:LglId>${LglId}</ns:LglId>
            <!--Optional:-->
            <ns:LosThrdDocDte>${LosThrdDocDte}</ns:LosThrdDocDte>
            <!--Optional:-->
            <ns:LosThrdDte>${LosThrdDte}</ns:LosThrdDte>
            <!--Optional:-->
            <ns:LosTypDscr>${LosTypDscr}</ns:LosTypDscr>
            <!--Optional:-->
            <ns:MapCarTypCod>${MapCarTypCod}</ns:MapCarTypCod>
            <!--Optional:-->
            <ns:MapCarTypNam>${MapCarTypNam}</ns:MapCarTypNam>
            <!--Optional:-->
            <ns:MapTypCod>${MapTypCod}</ns:MapTypCod>
            <!--Optional:-->
            <ns:MapTypNam>${MapTypNam}</ns:MapTypNam>
            <!--Optional:-->
            <ns:MapUsgCod>${MapUsgCod}</ns:MapUsgCod>
            <!--Optional:-->
            <ns:MapUsgNam>${MapUsgNam}</ns:MapUsgNam>
            <!--Optional:-->
            <ns:MapVehSysCod>${MapVehSysCod}</ns:MapVehSysCod>
            <!--Optional:-->
            <ns:MapVehSysNam>${MapVehSysNam}</ns:MapVehSysNam>
            <!--Optional:-->
            <ns:MtrNum>${MtrNum}</ns:MtrNum>
            <!--Optional:-->
            <ns:NjRptDte>${NjRptDte}</ns:NjRptDte>
            <!--Optional:-->
            <ns:NtnId>${NtnId}</ns:NtnId>
            <!--Optional:-->
            <ns:Plk>${Plk}</ns:Plk>
            <!--Optional:-->
            <ns:Plk1>${Plk1}</ns:Plk1>
            <!--Optional:-->
            <ns:Plk2>${Plk2}</ns:Plk2>
            <!--Optional:-->
            <ns:Plk3>${Plk3}</ns:Plk3>
            <!--Optional:-->
            <ns:PlkCty>${PlkCty}</ns:PlkCty>
            <!--Optional:-->
            <ns:PlkSrl>${PlkSrl}</ns:PlkSrl>
            <!--Optional:-->
            <ns:PlkTypCod>${PlkTypCod}</ns:PlkTypCod>
            <!--Optional:-->
            <ns:PrdDte>${PrdDte}</ns:PrdDte>
            <!--Optional:-->
            <ns:PrntDocLosCmpDocNo>${PrntDocLosCmpDocNo}</ns:PrntDocLosCmpDocNo>
            <!--Optional:-->
            <ns:PrsnDocLosCmpDocNo>${PrsnDocLosCmpDocNo}</ns:PrsnDocLosCmpDocNo>
            <!--Optional:-->
            <ns:ShsNum>${ShsNum}</ns:ShsNum>
            <!--Optional:-->
            <ns:Tel>${Tel}</ns:Tel>
            <!--Optional:-->
            <ns:ThrDmgTypCod>${ThrDmgTypCod}</ns:ThrDmgTypCod>
            <!--Optional:-->
            <ns:ThrLosTypCod>${ThrLosTypCod}</ns:ThrLosTypCod>
            <!--Optional:-->
            <ns:ThrPrsnTypCod>${ThrPrsnTypCod}</ns:ThrPrsnTypCod>
            <!--Optional:-->
            <ns:UnIrnCod>${UnIrnCod}</ns:UnIrnCod>
            <!--Optional:-->
            <ns:UsgCod>${UsgCod}</ns:UsgCod>
            <!--Optional:-->
            <ns:VIN>${VIN}</ns:VIN>
            <!--Optional:-->
            <ns:VehBgnDte>${VehBgnDte}</ns:VehBgnDte>
            <!--Optional:-->
            <ns:VehCmpCod>${VehCmpCod}</ns:VehCmpCod>
            <!--Optional:-->
            <ns:VehEndDte>${VehEndDte}</ns:VehEndDte>
            <!--Optional:-->
            <ns:VehPlcyCmpDocNo>${VehPlcyCmpDocNo}</ns:VehPlcyCmpDocNo>
            <!--Optional:-->
            <ns:VehSysCod>${VehSysCod}</ns:VehSysCod>
            <!--Optional:-->
            <ns:WbsCarDocLosUnqCod>${WbsCarDocLosUnqCod}</ns:WbsCarDocLosUnqCod>
            <!--Optional:-->
            <ns:ZipCod>${ZipCod}</ns:ZipCod>
            <!--Optional:-->
            <ns:version>${version}</ns:version>
         </tem:WbsCarDocLosPrsnReq>
         <!--Optional:-->
         <tem:Username>${Username}</tem:Username>
         <!--Optional:-->
         <tem:PassWrod>${PassWrod}</tem:PassWrod>
      </tem:RegWbsCarDocLosPrsn>
   </soapenv:Body>
</soapenv:Envelope>